writings/diss_workbook.org
* Counter-Code: Computational Methods for Working with Language
** topic:
- Computational methods for working with language about queerness. 

** book questions:
1. What do concepts from Queer Studies and adjacent fields offer to
   computational tools for working with text?
2. How do computational methods constrain the expressive potential of
   language into data?
3. How do concepts from Queer Studies and adjacent fields work against
   constraints in language data?

Template answers to questions:

1. What do concepts from Queer Studies and adjacent fields offer to
   computational tools for working with text?
   - [queer theory concept], offers an approach to [computational
     tool] that [does this to text].
     1. The Queer Studies concept of Gender Performativity offers an
        approach to text analysis that surfaces multiplicity in
        language meaning.
     2. QOCC's concept of dis-identification offers an approach to
        textual markup that delineates irreconcilable interpretations
        of language choices.
     3. Black Feminist Studies' concept of the flesh offers an
        approach for analyzing text display that is grounded in the
        physicality and materiality of the screen.
     4. Trans Studies' concept of normativity offers an approach to
        text generation that reveals shared investments across
        identity and subject groups.

2. How do these computational tools constrain the expressive
   potential of language into data?
   - [Constraint] [does something] to language [to make it this].
     1. In text analysis, "loops" strip language of idiosyncracies in
        order to count its common features.
     2. In textual markup, "tags" disambiguate and fix language to
        sort it into discrete elements within an ordered hierarchy.
     3. In text display, layers of computer software displace language
        processing away from human awareness in order to streamline
        interface effects.
     4. In text generation, algorithmic prediction aggregates language
        expressions to generalize and approximate patterns of language
        use.
	
3. How do concepts from Queer Studies and adjacent fields work against
   constraints in language data?
   - Queer studies [concept] [does a thing to work within and against
     constraint]
     1. From the concept of iteration, the emphasis on repetition
        influences a text analysis practice that multiplies and
        re-signifies word meaning.
     2. From the concept of dis-identification, the appropriation of
        dominant codes influences a markup strategy that delineates
        the boundaries of tagging structures.
     3. From the concept of the flesh, the foreclosure of depth
        suggests a close reading strategy that unleashes potential
        screen effects.
     4. From the concept of normativity, the generalization of
        language suggests a focus on shared investments between
        polarized perspectives.
** book argument
Concepts from Queer Studies and adjacent fields offer methodological
approaches to computational tools that work with text-based data. Such
tools, which are used for tasks like text generation, preservation,
and display, tend to constrain the expressive potential of language,
stripping its idiosyncrasies and ambiguities, to turn it into
computable units of data. Queer Studies and adjacent fields inspire
methodologies for working against these constraints---methodologies
that destabilize authoritative and delimiting structures, and open
novel readings of language data. By engaging closely and attentively
with these computational processes, users can resist the reductive
ways that technology works upon them.

** evidence
*** main examples or case studies:
- Computational tools and underlying processes.
- Theoretical concepts from minoritarian fields, queer theory mostly.
- Literary sources.
- Critical work in DH and Media Studies

*** chapter by chapter evidence base
- Chapter 1: Refers to text analysis methods and processes, the loop
  in python programming, word vectors, Queer Theory's concept of
  Gender Performativity, V Woolf's Orlando.
- Chapter 2: Refers to text encoding practices and projects, the XML
  data structure, Queer Theory's concept of dis-identification, Oscar
  Wilde's MS for The Picture of Dorian Gray.
- Chapter 3: Refers to media archaeological theory and practices,
  Black feminist studies theory, software layers and abstraction,
  Octavia Butler's Dawn and Entropy8Zuper's skinonskinonskin.
- Chapter 4: Refers to ML/text generation methods and practices, ML
  processes of training, Trans Studies theory on normativity and
  embodiment, popular discourse on transphobia and Reality TV.

