writings/diss_workbook.tex
% Created 2025-12-04 Thu 16:21
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{fcalado}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={fcalado},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.3 (Org mode 9.6.15)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{Counter-Code: Computational Methods for Working with Language}
\label{sec:org09c2b3c}
\subsection{topic:}
\label{sec:orgf7a8a9d}
\begin{itemize}
\item Computational methods for working with language about queerness.
\end{itemize}

\subsection{book questions:}
\label{sec:org91f3b34}
\begin{enumerate}
\item What do concepts from Queer Studies and adjacent fields offer to
computational tools for working with text?
\item How do computational methods constrain the expressive potential of
language into data?
\item How do concepts from Queer Studies and adjacent fields work against
constraints in language data?
\end{enumerate}

Template answers to questions:

\begin{enumerate}
\item What do concepts from Queer Studies and adjacent fields offer to
computational tools for working with text?
\begin{itemize}
\item\relax [queer theory concept], offers an approach to [computational
tool] that [does this to text].
\begin{enumerate}
\item The Queer Studies concept of Gender Performativity offers an
approach to text analysis that surfaces multiplicity in
language meaning.
\item QOCC's concept of dis-identification offers an approach to
textual markup that delineates irreconcilable interpretations
of language choices.
\item Black Feminist Studies' concept of the flesh offers an
approach for analyzing text display that is grounded in the
physicality and materiality of the screen.
\item Trans Studies' concept of normativity offers an approach to
text generation that reveals shared investments across
identity and subject groups.
\end{enumerate}
\end{itemize}

\item How do these computational tools constrain the expressive
potential of language into data?
\begin{itemize}
\item\relax [Constraint] [does something] to language [to make it this].
\begin{enumerate}
\item In text analysis, "loops" strip language of idiosyncracies in
order to count its common features.
\item In textual markup, "tags" disambiguate and fix language to
sort it into discrete elements within an ordered hierarchy.
\item In text display, layers of computer software displace language
processing away from human awareness in order to streamline
interface effects.
\item In text generation, algorithmic prediction aggregates language
expressions to generalize and approximate patterns of language
use.
\end{enumerate}
\end{itemize}

\item How do concepts from Queer Studies and adjacent fields work against
constraints in language data?
\begin{itemize}
\item Queer studies [concept] [does a thing to work within and against
constraint]
\begin{enumerate}
\item From the concept of iteration, the emphasis on repetition
influences a text analysis practice that multiplies and
re-signifies word meaning.
\item From the concept of dis-identification, the appropriation of
dominant codes influences a markup strategy that delineates
the boundaries of tagging structures.
\item From the concept of the flesh, the foreclosure of depth
suggests a close reading strategy that unleashes potential
screen effects.
\item From the concept of normativity, the generalization of
language suggests a focus on shared investments between
polarized perspectives.
\end{enumerate}
\end{itemize}
\end{enumerate}
\subsection{book argument}
\label{sec:orga339369}
Concepts from Queer Studies and adjacent fields offer methodological
approaches to computational tools that work with text-based data. Such
tools, which are used for tasks like text generation, preservation,
and display, tend to constrain the expressive potential of language,
stripping its idiosyncrasies and ambiguities, to turn it into
computable units of data. Queer Studies and adjacent fields inspire
methodologies for working against these constraints---methodologies
that destabilize authoritative and delimiting structures, and open
novel readings of language data. By engaging closely and attentively
with these computational processes, users can resist the reductive
ways that technology works upon them.

\subsection{evidence}
\label{sec:org7ee5c72}
\subsubsection{main examples or case studies:}
\label{sec:org8ce65b8}
\begin{itemize}
\item Computational tools and underlying processes.
\item Theoretical concepts from minoritarian fields, queer theory mostly.
\item Literary sources.
\item Critical work in DH and Media Studies
\end{itemize}

\subsubsection{chapter by chapter evidence base}
\label{sec:org7950e4a}
\begin{itemize}
\item Chapter 1: Refers to text analysis methods and processes, the loop
in python programming, word vectors, Queer Theory's concept of
Gender Performativity, V Woolf's Orlando.
\item Chapter 2: Refers to text encoding practices and projects, the XML
data structure, Queer Theory's concept of dis-identification, Oscar
Wilde's MS for The Picture of Dorian Gray.
\item Chapter 3: Refers to media archaeological theory and practices,
Black feminist studies theory, software layers and abstraction,
Octavia Butler's Dawn and Entropy8Zuper's skinonskinonskin.
\item Chapter 4: Refers to ML/text generation methods and practices, ML
processes of training, Trans Studies theory on normativity and
embodiment, popular discourse on transphobia and Reality TV.
\end{itemize}
