writings/diss_workbook.org
** chapter snapshots
- Chapter 1:
  - topic: text analysis to study gender
  - scope and evidence type:
    - Computational text analysis algorithms like Logistic Regression,
      Burrow's Delta.
    - the Queer Studies Theory of Gender Performativity,
    - Woolf's /Orlando/, Rosenberg's /Confessions of the Fox/ or
      /Nightwood/ or /Fun Home/.
  - main claims:
    - That dominant methods in text analysis use algorithms in a way
      that close off the kinds of readings we can peform on gender.
    - Python processes text to diminish peculiarities and move toward
      abstract connections.
    - One can iterate over binary structures in algorithms to open up,
      rather than collapse, possible associations in gender terms.
- Chapter 2:
  - topic: text preservation/markup to study sexuality
  - scope and evidence type:
    - Work and theory in textual scholarship and queer historiography.
    - TEI technology and projects that attempt to markup complex
      sexual IDs,
    - The first 3 chapters of the manuscript of Dorian Gray, maybe
      /Nightwood/, /Confessions/.
  - main claims:
    - TEI imposes not just disambiguation between elements but also a
      power structure which delimits what can and cannot be said.
    - The hierarchical nature of the TEI imposes a top-down control
      over all child elements; a situation that multiplicity will not
      solve.
    - We cannot mark up what has been lost, but we can see our own
      complicity in power structures.
- Chapter 3:
  - topic: text display to study sex
  - scope and evidence type:
    - Media archaeology theorizing on materiality.
    - Black feminist theorizing on the flesh.
    - The novel Dawn by Octavia Butler and /skinonskinonskin/
  - main claims:
    - That the collision/indeterminacy between thinking and feeling is
      a queer method of resisting circumscription within power
      structures.
    - Across layers of display and source code, surface effects are
      unmappable, fugitive, displaced, enabling significatory
      possbilities that resist technological constraints.
    - The pairing down to surface enables connectivity, intimacy.
- Chapter 4:
  - topic: text generation to study embodiment
  - scope and evidence type:
    - Trans studies on normativity
    - Machine learning technology and training process
    - Popular discourse in online journalism and reality tv
  - main claims:
    - Machine learning is a tool of approximation, reducing meaning to
      common denominators and flattening perspectives to univocality.
    - It can be used to find similar investments across polarizing
      perspectives. 
** organizing principle
Each chapter takes a different process for working with text,
identifies a computational constraint that reduces textual detail in
some way, and finds a way of working the constraint into a
close-reading practice.

- process for working with text -> constraint
1. text analysis, cleaning -> iteration (loops)
2. text preservation, encoding -> containment (tags)
3. text display, transformation -> abstraction (display)
4. text generation, normalization -> approximation (prediction algoirthms)
   
- constraint -> what it does to data -> how to resist 
1. iteration -> regularizes/homogenizes data -> repeat with difference
2. containment -> leaves out data -> narrate between gaps
3. abstraction -> displaces data -> close reading source code
4. approximation -> approximates data -> description?

** topic, claim, and metacommentary
Chapter 1:
- topic: Text analysis and gender
- claim: Text analysis methods that reduce complexity and variability
  of gender expression into binary forms can be "iterated" through
  different vantage points (close and distant) to surface
  multiplicity.
- metacommentary: Words have inherent multiplicity, meaning is always
  expanding beyond the binary. (But also, meaning is discursive,
  disembodied--lacking material realities, whitewashed).

Chapter 2:
- topic: Text encoding and sexuality
- claim: Hierarchical formats that categorize data can also suggest
  implicit power structures that delimit what is sayable and
  permissable.
- metacommentary: Meaning is inherent in organization and structure,
  controlling what can and cannot be signified. (Markup, inclusion
  into systems, isn't enough).

Chapter 3:
- topic: Text display and sex
- claim: Materiality exists even in abstracted forms, and points to
  significatory possibilities that resist circumscription.
- metacommentary: HOWEVER, the materiality of the sign offers a way of
  working within reductive signification processes.

Chapter 4:
- topic: Text generation and embodiment
- claim: Approximation of meaning finds commonalities between
  polarized perspectives.
- metacommentary: HOWEVER, univocality is a way of finding shared
  investments.

** TODO model books:
**** heavy processing
**** queer data studies? 
**** [[https://mitpress.mit.edu/9780262037006/the-fabric-of-interface/][The Fabric of Interface Mobile Media, Design, and Gender]], Stephen Monteiro, 2017
Topic: Contemporary digital media's connection to textile
arts/production. 

Claim: our everyday digital practice has taken on traits common to
textile and needlecraft culture, and textile metaphors used to
describe computing (weaving code, threaded discussions, zipped files,
software patches, switch fabrics) represent deeper connections between
digital communication and “homecraft” or “women's work.”

Evidence base:
- the production of hardware and software from their conception in the
  nineteenth century through twentieth-first-century globalized
  electronics industries
- textual and visual discourses around the digital, interactive,
  integrative practices of contemporary digital devices and
  their networked users
- needlecraft and textile techniques, handloom or quilting frame,
  mechanics of sewing and needlework
- augmented reality (AR) and VR systems such as Google Glass, Google
  Cardboard, and Oculus Rift

It's a good fit. Considering both everyday digital practices and
textile practices. Drawing analogies between these. 

**** [[https://mitpress.mit.edu/9780262517409/mechanisms/][Mechanisms New Media and the Forensic Imagination]], Matthew G. Kirschenbaum, 2012
**** [[https://direct.mit.edu/books/monograph/5133/Image-ObjectsAn-Archaeology-of-Computer-Graphics][Image Objects: An Archaeology of Computer Graphics]], Jacob Gaboury. 2023
The MIT Press DOI: https://doi.org/10.7551/mitpress/11077.001.0001
**** [[https://www.upress.umn.edu/9781517918774/a-users-guide-to-the-age-of-tech/][A User's Guide to the Age of Tech]], Grant Wythoff, 2025
U of Minnesota Press
