writings/diss_workbook.tex

\subsection{chapter snapshots}
\label{sec:org247c457}
\begin{itemize}
\item Chapter 1:
\begin{itemize}
\item topic: text analysis to study gender
\item scope and evidence type:
\begin{itemize}
\item Computational text analysis algorithms like Logistic Regression,
Burrow's Delta.
\item the Queer Studies Theory of Gender Performativity,
\item Woolf's \emph{Orlando}, Rosenberg's \emph{Confessions of the Fox} or
\emph{Nightwood} or \emph{Fun Home}.
\end{itemize}
\item main claims:
\begin{itemize}
\item That dominant methods in text analysis use algorithms in a way
that close off the kinds of readings we can peform on gender.
\item Python processes text to diminish peculiarities and move toward
abstract connections.
\item One can iterate over binary structures in algorithms to open up,
rather than collapse, possible associations in gender terms.
\end{itemize}
\end{itemize}
\item Chapter 2:
\begin{itemize}
\item topic: text preservation/markup to study sexuality
\item scope and evidence type:
\begin{itemize}
\item Work and theory in textual scholarship and queer historiography.
\item TEI technology and projects that attempt to markup complex
sexual IDs,
\item The first 3 chapters of the manuscript of Dorian Gray, maybe
\emph{Nightwood}, \emph{Confessions}.
\end{itemize}
\item main claims:
\begin{itemize}
\item TEI imposes not just disambiguation between elements but also a
power structure which delimits what can and cannot be said.
\item The hierarchical nature of the TEI imposes a top-down control
over all child elements; a situation that multiplicity will not
solve.
\item We cannot mark up what has been lost, but we can see our own
complicity in power structures.
\end{itemize}
\end{itemize}
\item Chapter 3:
\begin{itemize}
\item topic: text display to study sex
\item scope and evidence type:
\begin{itemize}
\item Media archaeology theorizing on materiality.
\item Black feminist theorizing on the flesh.
\item The novel Dawn by Octavia Butler and \emph{skinonskinonskin}
\end{itemize}
\item main claims:
\begin{itemize}
\item That the collision/indeterminacy between thinking and feeling is
a queer method of resisting circumscription within power
structures.
\item Across layers of display and source code, surface effects are
unmappable, fugitive, displaced, enabling significatory
possbilities that resist technological constraints.
\item The pairing down to surface enables connectivity, intimacy.
\end{itemize}
\end{itemize}
\item Chapter 4:
\begin{itemize}
\item topic: text generation to study embodiment
\item scope and evidence type:
\begin{itemize}
\item Trans studies on normativity
\item Machine learning technology and training process
\item Popular discourse in online journalism and reality tv
\end{itemize}
\item main claims:
\begin{itemize}
\item Machine learning is a tool of approximation, reducing meaning to
common denominators and flattening perspectives to univocality.
\item It can be used to find similar investments across polarizing
perspectives.
\end{itemize}
\end{itemize}
\end{itemize}
\subsection{organizing principle}
\label{sec:org87f8b22}
Each chapter takes a different process for working with text,
identifies a computational constraint that reduces textual detail in
some way, and finds a way of working the constraint into a
close-reading practice.

\begin{itemize}
\item process for working with text -> constraint
\item text analysis, cleaning -> iteration (loops)
\item text preservation, encoding -> containment (tags)
\item text display, transformation -> abstraction (display)
\item text generation, normalization -> approximation (prediction algoirthms)

\item constraint -> what it does to data -> how to resist
\item iteration -> regularizes/homogenizes data -> repeat with difference
\item containment -> leaves out data -> narrate between gaps
\item abstraction -> displaces data -> close reading source code
\item approximation -> approximates data -> description?
\end{itemize}

\subsection{topic, claim, and metacommentary}
\label{sec:orgb74ada1}
Chapter 1:
\begin{itemize}
\item topic: Text analysis and gender
\item claim: Text analysis methods that reduce complexity and variability
of gender expression into binary forms can be "iterated" through
different vantage points (close and distant) to surface
multiplicity.
\item metacommentary: Words have inherent multiplicity, meaning is always
expanding beyond the binary. (But also, meaning is discursive,
disembodied--lacking material realities, whitewashed).
\end{itemize}

Chapter 2:
\begin{itemize}
\item topic: Text encoding and sexuality
\item claim: Hierarchical formats that categorize data can also suggest
implicit power structures that delimit what is sayable and
permissable.
\item metacommentary: Meaning is inherent in organization and structure,
controlling what can and cannot be signified. (Markup, inclusion
into systems, isn't enough).
\end{itemize}

Chapter 3:
\begin{itemize}
\item topic: Text display and sex
\item claim: Materiality exists even in abstracted forms, and points to
significatory possibilities that resist circumscription.
\item metacommentary: HOWEVER, the materiality of the sign offers a way of
working within reductive signification processes.
\end{itemize}

Chapter 4:
\begin{itemize}
\item topic: Text generation and embodiment
\item claim: Approximation of meaning finds commonalities between
polarized perspectives.
\item metacommentary: HOWEVER, univocality is a way of finding shared
investments.
\end{itemize}

\subsection{{\bfseries\sffamily TODO} model books:}
\label{sec:org5672145}
\begin{enumerate}
\item heavy processing
\label{sec:org28f3fdd}
\item queer data studies?
\label{sec:org7f7d39a}
\item \href{https://mitpress.mit.edu/9780262037006/the-fabric-of-interface/}{The Fabric of Interface Mobile Media, Design, and Gender}, Stephen Monteiro, 2017
\label{sec:orge7c2799}
Topic: Contemporary digital media's connection to textile
arts/production. 

Claim: our everyday digital practice has taken on traits common to
textile and needlecraft culture, and textile metaphors used to
describe computing (weaving code, threaded discussions, zipped files,
software patches, switch fabrics) represent deeper connections between
digital communication and “homecraft” or “women's work.”

Evidence base:
\begin{itemize}
\item the production of hardware and software from their conception in the
nineteenth century through twentieth-first-century globalized
electronics industries
\item textual and visual discourses around the digital, interactive,
integrative practices of contemporary digital devices and
their networked users
\item needlecraft and textile techniques, handloom or quilting frame,
mechanics of sewing and needlework
\item augmented reality (AR) and VR systems such as Google Glass, Google
Cardboard, and Oculus Rift
\end{itemize}

It's a good fit. Considering both everyday digital practices and
textile practices. Drawing analogies between these. 

\item \href{https://mitpress.mit.edu/9780262517409/mechanisms/}{Mechanisms New Media and the Forensic Imagination}, Matthew G. Kirschenbaum, 2012
\label{sec:orgea93583}
\item \href{https://direct.mit.edu/books/monograph/5133/Image-ObjectsAn-Archaeology-of-Computer-Graphics}{Image Objects: An Archaeology of Computer Graphics}, Jacob Gaboury. 2023
\label{sec:org96d14e4}
The MIT Press DOI: \url{https://doi.org/10.7551/mitpress/11077.001.0001}
\item \href{https://www.upress.umn.edu/9781517918774/a-users-guide-to-the-age-of-tech/}{A User's Guide to the Age of Tech}, Grant Wythoff, 2025
\label{sec:org309e1bb}
U of Minnesota Press
\end{enumerate}
