writings/diss_workbook.org
** book narrative outline
Paragraph 1: What does my book as a whole do?
- [X] my book's topic: Computational methods for working with language
  about queerness.
- [X] book argument (see above)
- [X] implicit lesson:
  - By engaging closely and sensually with a technology, we can find
    ways of resisting its reductions, the ways it works upon us.
  - Experimenting with how something works in depth and in a sensual
    way will liberate us from being used and being users
- [X] To answer this question, I apply concepts from QS and related
  fields to work against constraints in computation using examples
  from literature as my test case. [or see evidence base above].

Paragraph 2: How does this book as a whole proceed? (how do the
arguments unfold over the chapters)
- [X] organizing principle (see above): Each chapter takes a different
  process for working with text, identifies a computational constraint
  within that process, and finds a way of working that constraint into
  a close-reading practice.
- [X] narrative arc (chapter 8)
  - moving from simple concepts to the complex processes.
    - introducing humanists to how computers work on a fundamental
      level. We start with the simple, with counting and categorizing,
      then we get deeper into stacks and machine learning.
    - the first two chapters are about simpler processes, counting and
      tagging, and the latter chapters are about more complex
      processes, abstraction and prediction.
      - I see other parallels between the two parts: the first part
        being about creating destabilization, and the second part
        about re-stabilizing; the first about queer theory and its
        methods, the second about adjacent fields and it's methods.
- [X] describe book structure (chapter 11):
  - The book is divided into two parts: part one, which explores core
    concepts in computation: chapter 1 explores counting, which is the
    bedrock of all analysis tasks; chapter 2 explores tagging which is
    the foundation of data formatting and structure. Then, part two
    explores more complex processes: chapter 3 explores
    interface/display processes, and chapter 4 explores text
    generation. The second half builds on concepts from the first to
    show more complex tools. Word vectors (ch 1) -> neural net
    training (ch 4), markup languages (ch 2)- > html code interacting
    with javascript (ch 3).
    
Paragraphs for body chapters:
- [ ] what does this chapter do in service of the book?
- [ ] start with a topic sentence from "what stays the same, what
  changes": 
  - from chapter one to chapter two: We move from text analysis to
    text encoding, from counting to markup. They are both basic,
    foundational acts of working with text data, but while analysis is
    about regularizing data to be counted, markup is about appending
    descriptive information to sort and structure data.
    - Impact:
      - Markup shows the implicit ways that data formats pre-
        determine what kind of information can be contained within
        them. This information has to do with power structures that
        delimit what can and cannot be said. "Occluding whiteness".
      - It also brings to the surface (in another way) how QS has
        looked over race and materializations. In the previous
        chapter, we found that the trope of fluidity overlooks
        material reality. In this chapter, we find that there is no
        formalization that will recuperate what has been left out of
        the structure. That the task must be otherwise.
  - from chapter two to chapter three: Looking at a more complex
    process, which is abstraction and display of data. Moving into
    Black Feminist studies, to find ways of addressing material
    concerns. We return to the materiality of the word, a stabilizing
    force.
    - Impact:
      - Now we can really "go deeper" than we did in previous
        chapters, where we merely dipped our toes.
      - We are zooming out to look at how a larger process, of
        abstraction, works on data. There is more complexity, we've
        learned more about how computation works to get here,
        regularizing data, plain text formatting, in particular, which
        helps the reader understand data stacks and how they work.
  - from chapter three to chapter four: Looking at algorithmic
    prediction and how that works to normalize data, similar to what
    we discussed in the first chapter. Moving to Trans Studies, to
    address underlying investments in normativity.
    - Impact:
      - The approximation of language revealing shared investments
        across political poles. Like the previous chapter, something
        shared, something solid.
- [ ] chapter snapshots (see above) on scope, evidence, and claims. 
- [ ] book answers for each chapter (see above)
 
