writings/diss_workbook.tex
\subsection{book narrative outline}
\label{sec:org594eed2}
Paragraph 1: What does my book as a whole do?
\begin{itemize}
\item[{$\boxtimes$}] my book's topic: Computational methods for working with language
about queerness.
\item[{$\boxtimes$}] book argument (see above)
\item[{$\boxtimes$}] implicit lesson:
\begin{itemize}
\item By engaging closely and sensually with a technology, we can find
ways of resisting its reductions, the ways it works upon us.
\item Experimenting with how something works in depth and in a sensual
way will liberate us from being used and being users
\end{itemize}
\item[{$\boxtimes$}] To answer this question, I apply concepts from QS and related
fields to work against constraints in computation using examples
from literature as my test case. [or see evidence base above].
\end{itemize}

Paragraph 2: How does this book as a whole proceed? (how do the
arguments unfold over the chapters)
\begin{itemize}
\item[{$\boxtimes$}] organizing principle (see above): Each chapter takes a different
process for working with text, identifies a computational constraint
within that process, and finds a way of working that constraint into
a close-reading practice.
\item[{$\boxtimes$}] narrative arc (chapter 8)
\begin{itemize}
\item moving from simple concepts to the complex processes.
\begin{itemize}
\item introducing humanists to how computers work on a fundamental
level. We start with the simple, with counting and categorizing,
then we get deeper into stacks and machine learning.
\item the first two chapters are about simpler processes, counting and
tagging, and the latter chapters are about more complex
processes, abstraction and prediction.
\begin{itemize}
\item I see other parallels between the two parts: the first part
being about creating destabilization, and the second part
about re-stabilizing; the first about queer theory and its
methods, the second about adjacent fields and it's methods.
\end{itemize}
\end{itemize}
\end{itemize}
\item[{$\boxtimes$}] describe book structure (chapter 11):
\begin{itemize}
\item The book is divided into two parts: part one, which explores core
concepts in computation: chapter 1 explores counting, which is the
bedrock of all analysis tasks; chapter 2 explores tagging which is
the foundation of data formatting and structure. Then, part two
explores more complex processes: chapter 3 explores
interface/display processes, and chapter 4 explores text
generation. The second half builds on concepts from the first to
show more complex tools. Word vectors (ch 1) -> neural net
training (ch 4), markup languages (ch 2)- > html code interacting
with javascript (ch 3).
\end{itemize}
\end{itemize}

Paragraphs for body chapters:
\begin{itemize}
\item[{$\square$}] what does this chapter do in service of the book?
\item[{$\square$}] start with a topic sentence from "what stays the same, what
changes": 
\begin{itemize}
\item from chapter one to chapter two: We move from text analysis to
text encoding, from counting to markup. They are both basic,
foundational acts of working with text data, but while analysis is
about regularizing data to be counted, markup is about appending
descriptive information to sort and structure data.
\begin{itemize}
\item Impact:
\begin{itemize}
\item Markup shows the implicit ways that data formats pre-
determine what kind of information can be contained within
them. This information has to do with power structures that
delimit what can and cannot be said. "Occluding whiteness".
\item It also brings to the surface (in another way) how QS has
looked over race and materializations. In the previous
chapter, we found that the trope of fluidity overlooks
material reality. In this chapter, we find that there is no
formalization that will recuperate what has been left out of
the structure. That the task must be otherwise.
\end{itemize}
\end{itemize}
\item from chapter two to chapter three: Looking at a more complex
process, which is abstraction and display of data. Moving into
Black Feminist studies, to find ways of addressing material
concerns. We return to the materiality of the word, a stabilizing
force.
\begin{itemize}
\item Impact:
\begin{itemize}
\item Now we can really "go deeper" than we did in previous
chapters, where we merely dipped our toes.
\item We are zooming out to look at how a larger process, of
abstraction, works on data. There is more complexity, we've
learned more about how computation works to get here,
regularizing data, plain text formatting, in particular, which
helps the reader understand data stacks and how they work.
\end{itemize}
\end{itemize}
\item from chapter three to chapter four: Looking at algorithmic
prediction and how that works to normalize data, similar to what
we discussed in the first chapter. Moving to Trans Studies, to
address underlying investments in normativity.
\begin{itemize}
\item Impact:
\begin{itemize}
\item The approximation of language revealing shared investments
across political poles. Like the previous chapter, something
shared, something solid.
\end{itemize}
\end{itemize}
\end{itemize}
\item[{$\square$}] chapter snapshots (see above) on scope, evidence, and claims.
\item[{$\square$}] book answers for each chapter (see above)
\end{itemize}
